/*
    Copyright © 2009, Muayyad Alsadi <alsadi@ojuba.org>

    Released under terms of Waqf Public License.
    This program is free software; you can redistribute it and/or modify
    it under the terms of the latest version Waqf Public License as
    published by Ojuba.org.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

    The Latest version of the license can be found on
    "http://waqf.ojuba.org/"
*/
var rsc = ['صحيح البخاري', 'صحيح مسلم' , 'سنن الترمذي']
/**
 * TODO: classify them into
 * 0 hamza=no, shadda=no, tashkeel=no
 * 1 hamza=yes, shadda=no, tashkeel=no
 * 1 hamza=yes, shadda=yes, tashkeel=no
 * 2 hamza=yes, shadda=yes, tashkeel=light
 * 3 hamza=yes, shadda=yes, tashkeel=heavy
 * 4 heavy tashkeel
 **/
/*
  var texts = new Array();
  texts[0]=['سبحان الله العظيم سبحان الله وبحمده']
 */
var texts=[
  ['اللهم لك الحمد أنت قيم السموات والأرض ومن فيهن، ولك الحمد لك ملك السموات والأرض ومن فيهن، ولك الحمد أنت نور السموات والأرض ومن فيهن، ولك الحمد أنت ملك السموات والأرض. ولك الحمد أنت الحق، ووعدك الحق، ولقاؤك حق، وقولك حق، والجنة حق، والنار حق، والنبيون حق، ومحمد - صلى الله عليه وسلم - حق، والساعة حق. اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت؛ فاغفر لي ما قدمت وما أخرت، وما أسررت، وما أعلنت. أنت المقدم وأنت المؤخر لا إله إلا أنت.',1053,0],
  ['اللهم إني أعوذ بك من الكسل والهرم والمأثم والمغرم ومن فتنة القبر وعذاب القبر ومن فتنة النار وعذاب النار ومن شر فتنة الغنى وأعوذ بك من فتنة الفقر وأعوذ بك من فتنة المسيح الدجال. اللهم اغسل عني خطاياي بماء الثلج والبرد ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب.',5891,0],
  ['سبحان الله عدد خلقه، سبحان الله عدد خلقه، سبحان الله عدد خلقه. سبحان الله رضا نفسه، سبحان الله رضا نفسه، سبحان الله رضا نفسه. سبحان الله زنة عرشه، سبحان الله زنة عرشه، سبحان الله زنة عرشه. سبحان الله مداد كلماته، سبحان الله مداد كلماته، سبحان الله مداد كلماته.',3478,2],
  ['اللهم رب السموات السبع ورب العرش العظيم ربنا ورب كل شيء منزل التوراة والإنجيل والقرآن فالق الحب والنوى أعوذ بك من شر كل شيء أنت آخذ بناصيته أنت الأول فليس قبلك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عني الدين وأغنني من الفقر.',3403,2],
  ['لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير',5924,0],
  ['اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري وما أنت أعلم به مني اللهم اغفر لي جدي وهزلي وخطئي وعمدي وكل ذلك عندي اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني أنت المقدم وأنت المؤخر وأنت على كل شيء قدير.',4896,1],
  ['اللهم إني أعوذ بك من العجز والكسل والجبن والبخل والهرم وعذاب القبر. اللهم آت نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها. اللهم إني أعوذ بك من علم لا ينفع ومن قلب لا يخشع ومن نفس لا تشبع ومن دعوة لا يستجاب لها.',4899,1],
  ['اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت.',5831,0],
  ['اللهم أصلح لي ديني الذي هو عصمة أمري وأصلح لي دنياي التي فيها معاشي وأصلح لي آخرتي التي فيها معادي واجعل الحياة زيادة لي في كل خير واجعل الموت راحة لي من كل شر.',4897,1]
];

